app/controllers/upload_documents_controller.rb

INSERT INTO "documents" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "string"], ["created_at", "2018-01-09 02:32:30.624675"], ["updated_at", "2018-01-09 02:32:30.624675"]]
---
  def create
    @document = Document.new(upload_document_params)
    if @document.save